In [1]:
import numpy as np
import pandas as pd

#### Creating a Dataframe

In [ ]:
data = {
    'Name': ['john', 'Anna', 'Peter', 'Linda'],
    'Age': [20,34,29,42],
    'city': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df1 = pd.DataFrame(data)
df1

    Name  Age      city  Salary
0   john   20  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [63]:
data_list = [['john', 20, 'New York', '65000'],
            ['Anna', 34, 'Paris', 70000],
            ['Peter', 29, 'Berlin', 62000],
            ['Linda', 42, 'London', 85000]]

df2 = pd.DataFrame(data_list)
df2
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns = columns)
df2

    Name  Age      City Salary
0   john   20  New York  65000
1   Anna   34     Paris  70000
2  Peter   29    Berlin  62000
3  Linda   42    London  85000

#### Selection and indexing of columns

In [64]:
df2['Name']
df2[['Name', 'City']]

    Name      City
0   john  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

#### Creating a new column

In [65]:
df2['Designation'] = ['Doctor', 'Engineer', 'Doctor', 'Engineer']
df2

    Name  Age      City Salary Designation
0   john   20  New York  65000      Doctor
1   Anna   34     Paris  70000    Engineer
2  Peter   29    Berlin  62000      Doctor
3  Linda   42    London  85000    Engineer

#### Removing columns

In [66]:
df2.drop('Designation', axis=1, inplace=True)
df2

    Name  Age      City Salary
0   john   20  New York  65000
1   Anna   34     Paris  70000
2  Peter   29    Berlin  62000
3  Linda   42    London  85000

In [67]:
df2.drop(['City', 'Salary'], axis=1) # it will show a copy of df2 not deleted from main memory, if we add inplace = True then it will be deleted form main memory

    Name  Age
0   john   20
1   Anna   34
2  Peter   29
3  Linda   42

In [68]:
df2

    Name  Age      City Salary
0   john   20  New York  65000
1   Anna   34     Paris  70000
2  Peter   29    Berlin  62000
3  Linda   42    London  85000

In [69]:
df2.drop(2, axis = 0)

    Name  Age      City Salary
0   john   20  New York  65000
1   Anna   34     Paris  70000
3  Linda   42    London  85000

In [70]:
df2

    Name  Age      City Salary
0   john   20  New York  65000
1   Anna   34     Paris  70000
2  Peter   29    Berlin  62000
3  Linda   42    London  85000

#### Selection of Rows

In [71]:
df2.loc[2]

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

In [72]:
df2.loc[[0,1]]

   Name  Age      City Salary
0  john   20  New York  65000
1  Anna   34     Paris  70000

#### Selecting subsets of rows and columns

In [73]:
df2.loc[[0,1]][['City', 'Salary']]

       City Salary
0  New York  65000
1     Paris  70000

In [60]:
df2.loc[[2,3]][['Name', 'Age']]

    Name Age
2  Peter  29
3  Linda  42

#### Conditional Selection

In [75]:
# People whose age is above 30
df2[df2["Age"] > 30]

    Name  Age    City Salary
1   Anna   34   Paris  70000
3  Linda   42  London  85000

In [77]:
# people whose age is above 30 and they lived in paris
df2[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

   Name  Age   City Salary
1  Anna   34  Paris  70000